{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [128], "name": "batch_normalization_1/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_1/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_1/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_1/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 1, 32], "name": "conv2d_1/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_1/bias"}, {"dtype": "float32", "shape": [32768, 9], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [9], "name": "dense_1/bias"}]}], "modelTopology": {"training_config": {"metrics": ["acc"], "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false, "lr": 0.0010000000474974513}}, "loss_weights": null, "sample_weight_mode": null}, "keras_version": "2.1.5", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": 1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_1"}, "name": "batch_normalization_1"}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "name": "elu_1"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["elu_1", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [4, 4], "padding": "valid", "strides": [4, 4]}, "name": "max_pooling2d_1"}, {"class_name": "Flatten", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 9, "use_bias": true, "activity_regularizer": null}, "name": "dense_1"}, {"class_name": "Activation", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "name": "activation_1"}], "output_layers": [["activation_1", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}, "backend": "tensorflow"}, "generatedBy": "keras v2.1.5", "convertedBy": "TensorFlow.js Converter v1.2.3", "format": "layers-model"}